Revit 2026 API

# ElementSet Properties

---

The ElementSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Size | Returns the number of elements that are in the set. |

#### Reference

ElementSet Class

Autodesk.Revit.DB Namespace